RBioc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>A current perspective on using R and Bioconductor for proteomics data analysis</title>
<!-- 2014-10-02 Thu 12:02 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Laurent Gatto" />
<link rel="stylesheet" type="text/css" href="../css/style0.css" />
</head>
<body>
<div id="content">
<h1 class="title">A current perspective on using R and Bioconductor for proteomics data analysis</h1>
<p>
Laurent Gatto<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup><sup>, </sup><sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>, Lisa M Breckels<sup><a id="fnr.1.100" name="fnr.1.100" class="footref" href="#fn.1">1</a></sup><sup>, </sup><sup><a id="fnr.2.100" name="fnr.2.100" class="footref" href="#fn.2">2</a></sup>, Thomas Lin Pedersen<sup><a id="fnr.3" name="fnr.3" class="footref" href="#fn.3">3</a></sup>, Vladislav A Petyuk<sup><a id="fnr.4" name="fnr.4" class="footref" href="#fn.4">4</a></sup>, Kathryn S Lilley<sup><a id="fnr.2.100" name="fnr.2.100" class="footref" href="#fn.2">2</a></sup> and Sebastian Gibb<sup><a id="fnr.1.100" name="fnr.1.100" class="footref" href="#fn.1">1</a></sup><sup>, </sup><sup><a id="fnr.5" name="fnr.5" class="footref" href="#fn.5">5</a></sup>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction and objectives</h2>
<div class="outline-text-2" id="text-1">
<p>
With the continuous increase in data throughput and experimental
designs complexity, the processing, analysis and interpretation of
proteomics data becomes a major bottleneck that can be tackled by the
appropriate use of statistical and computational tools. The R language
and in particular the Bioconductor project have a major impact on
other fields in high-throughput biology and benefited, in the recent
years, from substantial contributions from the computational
proteomics developers.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Methods</h2>
<div class="outline-text-2" id="text-2">
<p>
We summarise some of the latest R and Bioconductor developments in the
field of proteomics, including the support of open community-driven
formats for raw data and identification results, packages for
peptide-spectrum matching, methods quantitative proteomics, mass
spectrometry and quantitation data processing, visualisation and
interpretation.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Results and Discussion</h2>
<div class="outline-text-2" id="text-3">
<p>
We provide figures of the number of new package submissions and
downloads over the last Bioconductor releases to illustrate the recent
interest of the proteomics community in the Bioconductor
project. While the command line interface (CLI) represents a
considerable novelty for many life scientists, numerous documentation
and tutorials are available and an increasing number of tools also
provide graphical user interfaces in addition to the CLI. We also
discuss current needs and anticipated developments in the light of
recent progress.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Conclusions</h2>
<div class="outline-text-2" id="text-4">
<p>
The R/Bioconductor environment addresses some important issues in
computational proteomics and offers a unique set of interdisciplinary
expertise, capabilities and flexibility in the existing proteomics
software ecosystem. Noteworthy is also the introduction of tools and
technique of R development and usage that permit open and reproducible
computational research and data analysis, an area of increasing
importance in the current data intensive area.
</p>
</div>
</div>


<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Resources</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><b>R</b> <a href="http://www.r-project.org/">http://www.r-project.org/</a>
</li>
<li><b>Bioconductor</b> <a href="http://bioconductor.org/">http://bioconductor.org/</a>
</li>
<li><b>RforProteomics software</b> <a href="http://is.gd/R4Proteomics">http://is.gd/R4Proteomics</a>
</li>
<li><b>RforProteomics web</b> <a href="http://lgatto.github.io/RforProteomics/">http://lgatto.github.io/RforProteomics/</a>
</li>
<li><b>Google group</b> <a href="https://is.gd/rbioc_sig_proteomics">https://is.gd/rbioc_sig_proteomics</a>
</li>
<li><b>Support site</b> <a href="https://support.bioconductor.org">https://support.bioconductor.org</a>
</li>
<li><b>Poster</b> <a href="http://dx.doi.org/10.6084/m9.figshare.1190601">http://dx.doi.org/10.6084/m9.figshare.1190601</a>
</li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
<a href="http://cpu.sysbiol.cam.ac.uk">Computational Proteomics Unit</a>, Department of Biochemistry, University of Cambridge, Cambridge, UK
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
<a href="http://proteomics.bio.cam.ac.uk">Cambridge Centre for Proteomics</a>, Department of Biochemistry, University of Cambridge, Cambridge, UK
</p></div>

<div class="footdef"><sup><a id="fn.3" name="fn.3" class="footnum" href="#fnr.3">3</a></sup> <p class="footpara">
Chr. Hansen A/S, Hørsholm, Denmark / Technical University of Denmark, Kgs. Lyngby, Denmark
</p></div>

<div class="footdef"><sup><a id="fn.4" name="fn.4" class="footnum" href="#fnr.4">4</a></sup> <p class="footpara">
Biological Sciences Division, Pacific Northwest National Laboratory, Richland, WA, USA
</p></div>

<div class="footdef"><sup><a id="fn.5" name="fn.5" class="footnum" href="#fnr.5">5</a></sup> <p class="footpara">
Department of Anesthesiology and Intensive Care, Medical Faculty Carl Gustav Carus, Technical University Dresden, Fetscherstr. 74, 01307 Dresden
</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Laurent Gatto</p>
<p class="date">Created: 2014-10-02 Thu 12:02</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.7c)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
